{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"dtype": "float32", "data_format": "channels_first", "batch_input_shape": [null, 1, 28, 28], "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 6, "name": "Conv1", "kernel_size": [5, 5], "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_first", "name": "Pool1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_size": [5, 5], "activation": "relu", "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 16, "name": "Conv2", "bias_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_first", "name": "Pool2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_size": [5, 5], "activation": "relu", "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 120, "name": "Conv3", "bias_constraint": null, "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 84, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "hidden_2", "bias_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 10, "activation": "softmax", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "out", "bias_constraint": null, "trainable": true}}], "name": "sequential_15"}}