{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Flatten", "config": {"trainable": true, "batch_input_shape": [null, 1, 28, 28], "data_format": "channels_last", "dtype": "float32", "name": "flatten"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "hidden_1", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "act_hidden_1", "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "out", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "act_out", "activation": "softmax"}}], "name": "sequential_4"}}