{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"config": {"trainable": true, "name": "flatten", "dtype": "float32", "batch_input_shape": [null, 1, 28, 28], "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "hidden_1", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "units": 50, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "act_hidden_1", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"name": "out", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "units": 10, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "act_out", "activation": "softmax"}, "class_name": "Activation"}], "name": "sequential_1"}, "class_name": "Sequential"}